// Exercise #1: Decrease the Student Scores
let scores = [89, 70, 60, 50, 100, 71];

// Start coding here
// วันหนึ่งครูได้ออกมาประกาศว่า มีโจทย์ 1 ข้อที่ครูตรวจพลาดไป ข้อนี้ทุกคนทำผิดแต่ครูดันตรวจเป็นถูก โจทย์ข้อนี้มีคะแนน 10 คะแนน
// ดังนั้นครูจะต้องหักคะแนนของทุกคนออก 10 คะแนน
// ให้เขียนโปรแกรมด้วย For Loop เพื่อทำการหักคะแนนจากนักเรียนทุกคนใน Array scores คนละ 10 คะแนน
// เมื่อโปรแกรมทำงานจะแสดงผลลัพธ์ทางหน้าจอแบบนี้
// [79, 60, 50, 40, 90, 61]

for (let i = 0; i < scores.length; i++) {
  console.log(scores[i]);
  scores[i] -= 10;
  console.log(`คะแนนลำดับที่ ${i} หลังลบ 10 เท่ากับ ${scores[i]}`);
}
console.log(scores);
